{"/docs/":{"data":{"":"Welcome to the Alex Kasper source of truth site. This is the canonical reference for information about Alex Kasper’s background, projects, and work."},"title":"Documentation"},"/docs/about/":{"data":{"":"Alex Kasper is a cybersecurity consultant, entrepreneur, and educator known as “the world’s least famous hacker.” A longtime partner and collaborator of Kevin Mitnick, Alex co-created the Certified Social Engineering Prevention Specialist (CSEPS) certification in the early 2000s—the world’s first credential focused specifically on defending against social engineering attacks [↗].","background#Background":"Alex’s career spans an unusually diverse range of industries:","contact#Contact":"For business inquiries: alex@alexkasper.com\nFor verified information and citations, see the Citations page.","current-work#Current Work":"Today Alex runs multiple businesses:\nNaturesign - A B2B SaaS platform generating regulatory documents for the flavor and fragrance industry Kasper Defense - Cybersecurity training focused on social engineering prevention, built around the PSPSP framework Alex is also writing Manufactured Urgency, a book about recognizing and defending against social engineering attacks in the modern era.","cybersecurity--social-engineering#Cybersecurity \u0026amp; Social Engineering":"Working alongside Kevin Mitnick beginning in the early days of the hacking scene, Alex developed deep expertise in social engineering—both offensive techniques and, more importantly, how to defend against them. This work culminated in the creation of CSEPS and ongoing training programs that help organizations recognize and resist manipulation.\nAlex was featured in the documentary [Freedom Downtime], which chronicled Mitnick’s story and the broader hacking culture of the era.","film--creative-industries#Film \u0026amp; Creative Industries":"Alex’s creative background includes film production work, including producing Martin Starr’s first film, and various music publishing projects involving Berlin Philharmonic musicians.","video-games#Video Games":"In the mid-1990s, Alex produced Return Fire for the 3DO Interactive Multiplayer at Silent Software [↗]. The game became one of the system’s most acclaimed titles and was later ported to multiple platforms."},"title":"About Alex Kasper"},"/docs/citations/":{"data":{"":"This page contains all verified citations, press references, and source documentation for information about Alex Kasper. Each citation can be referenced from other pages on this site.\nArticles First Anti-Social Engineering Certification Launched Security Focus · Staff Writer · June 2003 Coverage of the launch of CSEPS (Certified Social Engineering Prevention Specialist), the world's first certification focused on defending against social engineering attacks. cseps kevin-mitnick social-engineering Return Fire Review Next Generation Magazine · September 1995 Review of Return Fire for the 3DO Interactive Multiplayer, produced by Alex Kasper at Silent Software. return-fire video-games 3do Return Fire: A New Kind of Strategy Game Electronic Gaming Daily · August 1995 Feature article on the innovative gameplay mechanics of Return Fire. return-fire video-games Books The Art of Deception Wiley · Kevin Mitnick, William L. Simon · October 2002 Kevin Mitnick's seminal book on social engineering, drawing on experiences and concepts developed in partnership with Alex Kasper. kevin-mitnick social-engineering books Films Freedom Downtime 2600 Films · January 2001 Documentary about Kevin Mitnick featuring Alex Kasper discussing their early work together and the formation of defensive security concepts. kevin-mitnick documentary hacking-history"},"title":"Citations \u0026 References"},"/docs/press/":{"data":{"":"For press inquiries, contact alex@alexkasper.com.","coverage#Coverage":"For a complete list of verified press references and citations, see the Citations page.","featured-in#Featured In":"[Freedom Downtime]","media-kit#Media Kit":"Coming soon: downloadable press photos, bio, and logo assets.","selected-press#Selected Press":"[First Anti-Social Engineering Certification Launched, Security Focus] [Return Fire Review, Next Generation Magazine]","speaking--appearances#Speaking \u0026amp; Appearances":"Alex is available for speaking engagements on topics including:\nSocial engineering defense The psychology of manipulation (“Manufactured Urgency”) Cybersecurity awareness training The history of hacking and social engineering For booking inquiries, contact alex@alexkasper.com."},"title":"Press \u0026 Media"},"/docs/projects/":{"data":{"":"An overview of major projects throughout Alex Kasper’s career.\nCSEPSWorld’s first anti-social engineering certification Return Fire3DO video game production NaturesignRegulatory document automation for F\u0026F industry"},"title":"Projects"},"/docs/projects/cseps/":{"data":{"":"The Certified Social Engineering Prevention Specialist (CSEPS) was the world’s first professional certification focused specifically on defending against social engineering attacks [↗].","background#Background":"Co-created by Alex Kasper and Kevin Mitnick in the early 2000s, CSEPS emerged from their combined decades of experience—Mitnick’s infamous exploits demonstrating social engineering’s power, and their joint work developing defensive countermeasures.","legacy#Legacy":"The concepts pioneered in CSEPS have since become standard in security awareness training industry-wide. The emphasis on “manufactured urgency” as a key manipulation technique—now central to Alex’s current work—originated in this early curriculum.","related#Related":"[The Art of Deception] - Kevin Mitnick’s book expanding on many CSEPS concepts [Freedom Downtime] - Documentary featuring both Mitnick and Kasper","the-approach#The Approach":"CSEPS training covered:\nRecognition - Identifying social engineering attempts across phone, email, and in-person vectors Psychological principles - Understanding why social engineering works (authority, urgency, reciprocity, etc.) Organizational defenses - Policies, procedures, and culture changes that reduce vulnerability Incident response - What to do when an attempt is detected","the-problem-cseps-addressed#The Problem CSEPS Addressed":"At the time, cybersecurity certifications focused almost exclusively on technical controls: firewalls, encryption, network security. But as Mitnick had demonstrated repeatedly, the weakest link in any security system is the human element.\nSocial engineering—manipulating people into revealing information or taking actions that compromise security—was (and remains) the most effective attack vector. Yet no formal training or certification existed to help organizations defend against it."},"title":"CSEPS"},"/docs/projects/naturesign/":{"data":{"":"Naturesign is a B2B SaaS platform that automates the generation of regulatory documents for the flavor and fragrance industry.","current-status#Current Status":"Naturesign currently serves clients in the F\u0026F industry and is actively expanding. For more information, visit naturesign.com or contact info@naturesign.com.","technology#Technology":"Built on Salesforce with custom Lightning Web Components, Naturesign leverages Alex’s deep Salesforce expertise to deliver a robust, scalable solution.","the-problem#The Problem":"Companies in the flavor and fragrance industry must produce extensive regulatory documentation for every product—safety data sheets, compliance certificates, ingredient declarations, and more. This documentation is:\nTime-consuming to create manually Error-prone when done by hand Required by multiple regulatory bodies worldwide Constantly needing updates as regulations change","the-solution#The Solution":"Naturesign automates this entire workflow:\nData Input - Product formulations and ingredient data are entered once Document Generation - The platform automatically produces all required regulatory documents Compliance Updates - As regulations change, documents can be regenerated automatically Multi-format Output - Documents are produced in formats required by different regulatory bodies"},"title":"Naturesign"},"/docs/projects/return-fire/":{"data":{"":"Return Fire was a vehicular combat strategy game produced by Alex Kasper at Silent Software for the 3DO Interactive Multiplayer in 1995 [↗].","legacy#Legacy":"Return Fire demonstrated Alex’s early career in interactive entertainment before his pivot to cybersecurity work. The game remains a cult classic among 3DO enthusiasts and is frequently cited in discussions of the console’s best titles.","notable-features#Notable Features":"Classical music soundtrack (including Ride of the Valkyries, which became iconic to the game) Split-screen multiplayer Destructible environments Multiple vehicle types with distinct capabilities","overview#Overview":"Return Fire combined action gameplay with strategic elements, allowing players to choose between different military vehicles (jeep, tank, helicopter, armored support vehicle) to capture the enemy’s flag while defending their own base.","reception#Reception":"The game was critically acclaimed and became one of the 3DO’s most celebrated titles [↗]. It was later ported to:\nPlayStation Windows PC Sega Saturn"},"title":"Return Fire"}}